tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "rs/tap"
tap "pulumi/tap"

# prompt
brew "starship"

# A better ps
brew "procs"

# A better nvm
brew "fnm"

# GNU core utilities (those that come with macOS are outdated)
brew "coreutils"
brew "moreutils"

# GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "findutils"

# GNU `sed`, overwriting the built-in `sed`
# Update -- https://discourse.brew.sh/t/why-was-with-default-names-removed/4405/8 -- overwriting no longer valid
brew "gnu-sed"

# A better to curl
brew "curlie"

brew "wget"

# homebrew version of curl did not work downloading certain files. Investigating...
brew "curl"

brew "pyenv"

brew "zoxide"

# Better than Apple versions
brew "grep"
brew "openssl"


# Simple, fast and user-friendly alternative to find
brew "fd"

# Alternative to the grep command - much faster one, with sane defaults and colorized output.
brew "ripgrep"

# github util. gotta love `hub fork`, `hub create`, `hub checkout <PRurl>`
brew "git"
brew "git-extras"
brew "tree"

# shells
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

brew "fish"
brew "fisher"

# colorize the world
brew "grc"

# A better sed
brew "sd"

# A better du
brew "dust"

# hyperfine is a command-line benchmarking tool
brew "hyperfine"

# tokei is a program that displays statistics about your code
brew "tokei"

# A better cat
brew "bat"

# JSON searching
brew "jq"

# Fuzzy finding
brew "fzf"

# Network utility
brew "netcat"

# A better `ls`
brew "eza"

# A beter man pages
brew "tealdeer"

# bandwhich is a CLI utility for displaying current network utilization by process, connection and remote IP or hostname.
brew "bandwhich"

# grex is a command-line tool and library for generating regular expressions from user-provided test cases.
brew "grex"

# View markdown in the terminal
brew "glow"

# Docker
brew "colima"
brew "docker"
brew "docker-compose"

brew "macos-trash"

brew "pulumi"
brew "awscli"


# quicklook hotness
cask "syntax-highlight", args: { no_quarantine: true }
cask "qlstephen"
cask "qlmarkdown", args: { no_quarantine: true }

# Screen recording software
cask "kap"

cask "alfred"
cask "lastpass"
cask "suspicious-package"
cask "brave-browser"
cask "iterm2"
cask "open-in-code"
cask "rectangle"
cask "visual-studio-code"
cask "discord"
cask "itsycal"
cask "spotify"
cask "monitorcontrol"
cask "appcleaner"
cask "slack"
cask "tower"
cask "notion"

cask "font-cascadia-code"
cask "font-cascadia-code-pl"

