alefragnani.Bookmarks
alexdima.copy-relative-path
amazonwebservices.aws-toolkit-vscode
andrewmarkle.primer-light
bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
bungcip.better-toml
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
codezombiech.gitignore
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
drKnoxy.eslint-disable-snippets
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
fabiospampinato.vscode-open-in-gittower
felipecaputo.git-project-manager
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
foxundermoon.shell-format
GitHub.github-vscode-theme
GitHub.vscode-pull-request-github
Gruntfuggly.todo-tree
hdevalke.rust-test-lens
heybourn.headwind
humao.rest-client
jeff-hykin.better-shellscript-syntax
mattpocock.ts-error-translator
mikestead.dotenv
ms-azuretools.vscode-docker
nemesv.copy-file-name
nwallace.peep
oderwat.indent-rainbow
Orta.vscode-jest
rangav.vscode-thunder-client
richie5um2.vscode-sort-json
rust-lang.rust-analyzer
sburg.vscode-javascript-booster
Semgrep.semgrep
skyapps.fish-vscode
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker
tombonnike.vscode-status-bar-format-toggle
Tyriar.sort-lines
vadimcn.vscode-lldb
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
wmaurer.change-case
zhuangtongfa.material-theme
