Compulim.compulim-vscode-closetag
EditorConfig.EditorConfig
Orta.vscode-jest
PKief.material-icon-theme
PeterJausovec.vscode-docker
Rubymaniac.vscode-paste-and-indent
SintrumIT.theme-oceanic-next-italic
TeddyDD.fish
abusaidm.html-snippets
adambaldwin.vscode-nsp
akamud.vscode-theme-onedark
alefragnani.Bookmarks
alexdima.copy-relative-path
andischerer.theme-atom-one-dark
anseki.vscode-color
azemoh.theme-onedark
be5invis.vscode-custom-css
bengreenier.vscode-node-readme
bierner.markdown-preview-github-styles
bradgashler.htmltagwrap
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
codezombiech.gitignore
cssho.vscode-svgviewer
dbaeumer.vscode-eslint
dbankier.vscode-instant-markdown
donjayamanne.githistory
eamodio.gitlens
eg2.vscode-npm-script
fabianlauer.vs-code-xml-format
fabiospampinato.vscode-open-in-gittower
felipecaputo.git-project-manager
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
ginfuru.ginfuru-onedark-raincoat-theme
glen-84.sass-lint
hangxingliu.vscode-nginx-conf-hint
hwencc.html-tag-wrapper
idleberg.badges
ionutvmi.path-autocomplete
jasonnutter.search-node-modules
joshpeng.sublime-babel-vscode
kisstkondoros.csstriggers
kisstkondoros.vscode-codemetrics
letrieu.expand-region
lukehoban.Go
michelemelluso.code-beautifier
mitchdenny.ecdc
mohsen1.prettify-json
mrmlnc.vscode-lebab
mrmlnc.vscode-remark
mrmlnc.vscode-scss
ms-vscode.azure-account
ms-vscode.node-debug2
ms-vscode.sublime-keybindings
ms-vscode.Theme-MarkdownKit
msjsdiag.debugger-for-chrome
mushan.vscode-paste-image
nemesv.copy-file-name
nwallace.peep
ow.vscode-subword-navigation
ria.elastic
robinbentley.sass-indented
satokaz.vscode-toggleproxy
searKing.preview-vscode
seijifujita.vscode-tag-jump
shanoor.vscode-nginx
sleistner.vscode-fileutils
swyphcosmo.spellchecker
thekalinga.bootstrap4-vscode
timonwong.shellcheck
tomoki1207.vscode-gfm-preview
tuxtina.json2yaml
vincaslt.highlight-matching-tag
vittorioromeo.expand-selection-to-scope
vsmobile.vscode-react-native
waderyan.gitblame
wix.vscode-import-cost
wmaurer.change-case
wmaurer.join-lines
xabikos.JavaScriptSnippets
xabikos.ReactSnippets
zhuangtongfa.Material-theme