laughedelic/brew-completions
paysonwallach/fish-you-should-use
PatrickF1/fzf.fish
jhillyerd/plugin-git
wfxr/forgit
nickeb96/puffer-fish
jorgebucaran/fisher
starship/starship
danhper/fish-ssh-agent
