fisherman/await
fisherman/docker-completion
barnybug/docker-fish-completion
fisherman/fin
fisherman/fnm
fisherman/get_file_age
fisherman/getopts
oh-my-fish/plugin-grc
fisherman/host_info
fisherman/imgcat
fisherman/last_job_id
fisherman/menu
rafaelrinaldi/pure
fisherman/settitle
oh-my-fish/plugin-tab
oh-my-fish/plugin-percol
fisherman/vault
fisherman/cprintf
fisherman/z
